AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.2.alpha.1.1/mcu/apollo510L/regs/am_mcu_apollo510L_otpinfoc.h
// KEYBANK_CUST_QUADRANT1_KEY2 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY2_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY2_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY2_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY2_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY2_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT1_KEY3 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY3_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY3_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY3_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY3_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY3_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT1_KEY4 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY4_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY4_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY4_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY4_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY4_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT1_KEY5 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY5_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY5_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY5_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY5_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY5_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT1_KEY6 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY6_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY6_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY6_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY6_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY6_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT1_KEY7 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY7_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY7_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY7_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY7_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY7_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT1_KEY8 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY8_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY8_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY8_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY8_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY8_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT1_KEY9 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY9_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY9_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY9_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY9_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY9_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT1_KEY10 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY10_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY10_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY10_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY10_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY10_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT1_KEY11 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY11_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY11_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY11_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY11_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY11_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT1_KEY12 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY12_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY12_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY12_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY12_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY12_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT1_KEY13 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY13_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY13_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY13_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY13_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY13_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT1_KEY14 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY14_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY14_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY14_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY14_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY14_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT1_KEY15 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY15_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY15_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY15_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY15_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY15_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT2_KEY0 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY0_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY0_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY0_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY0_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY0_KEY_Msk 0xFFFFFFFF

// KEYBANK_CUST_QUADRANT2_KEY1 - Customer key bank
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY1_KEY_S 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY1_KEY_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY1_KEY(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY1_KEY_Pos 0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY1_KEY_Msk 0xFFFFFFFF

